export default {
  'logout': 'Вы вышли из системы',
  'login': 'Для начала работы войдите в систему',
  'auth/user-not-found': "Пользователь с таким Email не зарегистрирован, возможно он был удален",
  'auth/wrong-password': "Неверный пароль",
  "auth/too-many-requests": "Доступ к аккаунту времеено закрыт из-за большого числа неудачных попыток входа. Попробуйте войти позже",
  "auth/email-already-in-use": "Указанный Email уже используется для другого аккаунта",
  "auth/weak-password": "Пароль должен быть не менее 6 символов"
}