<template>
  <div>
    <section class="intro">
      <p>Решаем любые задачи</p>
      <h1>{{ pageHeaderH1 }}</h1>
      <p>Нам нравится видеть результат нашей работы</p>
      <div class="viewport-footer">
        <SocialLinks :theme="`light`" />
        <Showreel />
      </div>
    </section>

    <hr />

    <section class="main_in_work">
      <span>Главное в работе</span>
      <h2>
        Наши специалисты станут продолжением вашей компании, но совершенно
        самостоятельным
      </h2>
      <p>
        Каждый из нас выбрал это направление благодаря его гибкости и
        разнообразию! Множество идей и способов их реализации мы используем
        каждый день.Наша команда — это профессионалы своего дела, которых не
        пугают сложности.
      </p>
      <p>
        Выполнять интересные проекты быстро и качественно Нужно уходить от слов
        быстро — это то, к чему мы стремимся. Лучшим результатом станет
        вовлечённость пользователей — для достижения этой цели мы предложим
        комплексное решение и создадим максимально удобный и понятный продукт.
      </p>

      <div>
        <div class="img"></div>
        <p>
          Наша команда — это профессионалы своего дела, которых не пугают
          сложности.
        </p>
      </div>

      <div>
        <div class="img"></div>
        <p>
          Мы не будем простым исполнителем заданий. Вы получите решение любых
          задач, и, что не менее важно, предложения по эффективному развитию
          бизнеса. В любом направлении нашей работы, сталкиваясь с новинками,
          доказавшими свою эффективность, мы стараемся применить их на практике
        </p>
      </div>
    </section>

    <Activities />

    <section class="teammates">
      <h2>И, хотя каждый из нас уникален, работаем мы как единое целое</h2>
      <p>С кем вы будете побеждать</p>
      <hr>

      <Teammate  v-for="person of 5" :num="person" :key="person"/>


    </section>
  </div>
</template>

<script>
export default {
  name: "aboutPage",
  layout: "default",
  head() {
    return {
      title: "Команда",
      meta: [{hid: "description", name: "description", content: "Описание страницы Команда"}]
    };
  },
  data: () => ({
    pageHeaderH1:
      "Мы применяем комплексный подход к каждому клиенту: от стратегии до достижения целей"
  })
};
</script>

<style></style>
