<template>
  <section>
    <h1>
      Хотите работать и развиваться в сфере digital?<span class="dark"
        >С радостью поможем и будем развиваться вместе!</span
      >
    </h1>



    <h2>Вакансии</h2>
    <ul>
      <li v-for="(job, key) in jobs" :key="key">
        <div class="vacancy_title">{{ job["ru-RU"].title }}</div>
        <!-- <div class="vacancy_description" v-html="job['ru-RU'].content"></div> -->
      </li>
    </ul>

    <h2>Мотивирован много работать и нацелен на результат?</h2>
    <p>
      Хорошо подумай перед написание в резюме «быстрообучаемость» и
      «стрессоустойчивость». У нас нет должностей с лёгкой работой.
    </p>
    <p>
      Готовься к испытательному сроку и тестовым заданиям. Мы должны понять,
      соответствует ли твой уровень подготовки тому, который нам нужен. Учись
      разговаривать с людьми, даже если ты не менеджер – с клиентами может
      потребоваться взаимодействовать всем. У нас нет жёсткого дресс-кода, но
      спортивные костюмы оставь для пробежек, выглядеть нужно презентабельно.
    </p>
    <p>
      Webmedia может стать хорошим стартом, если ты готов учиться и стараться
      вместе с нами. Если у тебя уже есть опыт, мы направим навыки в нужное нам
      русло. Перед устройством заверши все проекты на старом рабочем месте,
      потом времени на это не будет. Надумаешь уйти – закончи все начатые
      задачи.
    </p>
    <p>
      Мы хотим, чтобы сотрудники понимали важность постоянства и
      ответственности. Наша компания не подходит для работы по совместительству
      и не терпит «леваков» - оплачиваем 100% рабочего времени.
    </p>
    <p>
      Нам нравится работать с людьми, осознающими свой выбор и готовыми
      развиваться – нет смысла устраиваться на короткий срок. С нашей стороны
      есть все условия для комфортной и продуктивной работы с достойной оплатой.
    </p>

    <h3>Организационные моменты:</h3>
    <ul>
      <li>рабочий день длится 8 часов, плюс часовой перерыв на обед;</li>
      <li>мы работаем 5 дней в неделю;</li>
      <li>
        начало работы в 9:00, не опаздывай, о форс-мажорах предупреждай заранее;
      </li>
      <li>
        алкоголь зарешён после 18:00, но в будни помни, что тебе завтра на
        работу.
      </li>
    </ul>

    <h3>Минимальные требования:</h3>
    <ul>
      <li>возможность приходить в студию ежедневно;</li>
      <li>умение взаимодействовать, задавать вопросы и давать ответы;</li>
      <li>старание делать работу лучше других.</li>
    </ul>

    <div class="call_to_cation">Узнай больше о нашей команде!</div>
    <RotatingLink :text="`Наша команда`"  :link="{ name: 'about' }" :textOffset="7" />



  </section>
</template>

<script>
export default {
  async fetch({ store }) {
    if (store.getters["jobs/jobs"].length === 0) {
      await store.dispatch("jobs/fetchJobs");
    }
  },
  computed: {
    jobs() {
      return this.$store.getters["jobs/jobs"];
    }
  }
};
</script>
